jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/*******************************************************************************
* Copyright (C) 2014 Maxim Integrated Products, Inc., All Rights Reserved.
*
* Permission is hereby granted, free of charge, to any person obtaining a
* copy of this software and associated documentation files (the "Software"),
* to deal in the Software without restriction, including without limitation
* the rights to use, copy, modify, merge, publish, distribute, sublicense,
* and/or sell copies of the Software, and to permit persons to whom the
* Software is furnished to do so, subject to the following conditions:
*
* The above copyright notice and this permission notice shall be included
* in all copies or substantial portions of the Software.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
* OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
* OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
* ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
* OTHER DEALINGS IN THE SOFTWARE.
*
* Except as contained in this notice, the name of Maxim Integrated
* Products, Inc. shall not be used except as stated in the Maxim Integrated
* Products, Inc. Branding Policy.
*
* The mere transfer of this software does not imply any licenses
* of trade secrets, proprietary technology, copyrights, patents,
* trademarks, maskwork rights, or any other form of intellectual
* property whatsoever. Maxim Integrated Products, Inc. retains all
* ownership rights.
*
* $Id: gpio_regs.h 14674 2014-08-15 14:45:13Z jeremy.brodt $
*
********************************************************************************
*/

#ifndef _MXC_GPIO_REGS_H_
#define _MXC_GPIO_REGS_H_

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif

typedef struct {
    __IO uint32_t en;
    __IO uint32_t en_set;
    __IO uint32_t en_clr;
    __IO uint32_t out_en;
    __IO uint32_t out_en_set;
    __IO uint32_t out_en_clr;
    __IO uint32_t out;
    __IO uint32_t out_set;
    __IO uint32_t out_clr;
    __I  uint32_t in;
    __IO uint32_t int_mod;
    __IO uint32_t int_pol;
    __R  uint32_t rsv1;
    __IO uint32_t int_en;
    __IO uint32_t int_en_set;
    __IO uint32_t int_en_clr;
    __I  uint32_t int_stat;
    __R  uint32_t rsv2;
    __IO uint32_t int_clr;
    __IO uint32_t wake_en;
    __R  uint32_t rsv3;
    __R  uint32_t rsv4;
    __IO uint32_t open_drain_en;
    __IO uint32_t int_dual_edge;
    __IO uint32_t pad_cfg1;
    __IO uint32_t pad_cfg2;
    __IO uint32_t en1;
    __IO uint32_t en1_set;
    __IO uint32_t en1_clr;
    __R  uint32_t rsv5;
    __IO uint32_t ds;
} mxc_gpio_regs_t;

/* Register offsets */
#define MXC_R_GPIO_OFFS_EN            ((uint32_t)0x00000000UL)
#define MXC_R_GPIO_OFFS_EN_SET        ((uint32_t)0x00000004UL)
#define MXC_R_GPIO_OFFS_EN_CLR        ((uint32_t)0x00000008UL)
#define MXC_R_GPIO_OFFS_OUT_EN        ((uint32_t)0x0000000CUL)
#define MXC_R_GPIO_OFFS_OUT_EN_SET    ((uint32_t)0x00000010UL)
#define MXC_R_GPIO_OFFS_OUT_EN_CLR    ((uint32_t)0x00000014UL)
#define MXC_R_GPIO_OFFS_OUT           ((uint32_t)0x00000018UL)
#define MXC_R_GPIO_OFFS_OUT_SET       ((uint32_t)0x0000001CUL)
#define MXC_R_GPIO_OFFS_OUT_CLR       ((uint32_t)0x00000020UL)
#define MXC_R_GPIO_OFFS_IN            ((uint32_t)0x00000024UL)
#define MXC_R_GPIO_OFFS_INT_MOD       ((uint32_t)0x00000028UL)
#define MXC_R_GPIO_OFFS_INT_POL       ((uint32_t)0x0000002CUL)
#define MXC_R_GPIO_OFFS_INT_EN        ((uint32_t)0x00000034UL)
#define MXC_R_GPIO_OFFS_INT_EN_SET    ((uint32_t)0x00000038UL)
#define MXC_R_GPIO_OFFS_INT_EN_CLR    ((uint32_t)0x0000003CUL)
#define MXC_R_GPIO_OFFS_INT_STAT      ((uint32_t)0x00000040UL)
#define MXC_R_GPIO_OFFS_INT_CLR       ((uint32_t)0x00000048UL)
#define MXC_R_GPIO_OFFS_WAKE_EN       ((uint32_t)0x0000004CUL)
#define MXC_R_GPIO_OFFS_INT_DUAL_EDGE ((uint32_t)0x0000005CUL)
#define MXC_R_GPIO_OFFS_PAD_CFG1      ((uint32_t)0x00000060UL)
#define MXC_R_GPIO_OFFS_PAD_CFG2      ((uint32_t)0x00000064UL)
#define MXC_R_GPIO_OFFS_EN1           ((uint32_t)0x00000068UL)
#define MXC_R_GPIO_OFFS_EN1_SET       ((uint32_t)0x0000006CUL)
#define MXC_R_GPIO_OFFS_EN1_CLR       ((uint32_t)0x00000070UL)
#define MXC_R_GPIO_OFFS_DS            ((uint32_t)0x000000B0UL)

/* EN 00 */
#define MXC_F_GPIO_EN_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_EN_00_POS (0)

/* EN 01 */
#define MXC_F_GPIO_EN_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_EN_01_POS (1)

/* EN 02 */
#define MXC_F_GPIO_EN_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_EN_02_POS (2)

/* EN 03 */
#define MXC_F_GPIO_EN_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_EN_03_POS (3)

/* EN 04 */
#define MXC_F_GPIO_EN_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_EN_04_POS (4)

/* EN 05 */
#define MXC_F_GPIO_EN_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_EN_05_POS (5)

/* EN 06 */
#define MXC_F_GPIO_EN_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_EN_06_POS (6)

/* EN 07 */
#define MXC_F_GPIO_EN_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_EN_07_POS (7)

/* EN 08 */
#define MXC_F_GPIO_EN_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_EN_08_POS (8)

/* EN 09 */
#define MXC_F_GPIO_EN_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_EN_09_POS (9)

/* EN 10 */
#define MXC_F_GPIO_EN_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_EN_10_POS (10)

/* EN 11 */
#define MXC_F_GPIO_EN_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_EN_11_POS (11)

/* EN 12 */
#define MXC_F_GPIO_EN_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_EN_12_POS (12)

