jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* EN 13 */
#define MXC_F_GPIO_EN_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_EN_13_POS (13)

/* EN 14 */
#define MXC_F_GPIO_EN_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_EN_14_POS (14)

/* EN 15 */
#define MXC_F_GPIO_EN_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_EN_15_POS (15)

/* EN 16 */
#define MXC_F_GPIO_EN_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_EN_16_POS (16)

/* EN 17 */
#define MXC_F_GPIO_EN_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_EN_17_POS (17)

/* EN 18 */
#define MXC_F_GPIO_EN_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_EN_18_POS (18)

/* EN 19 */
#define MXC_F_GPIO_EN_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_EN_19_POS (19)

/* EN 20 */
#define MXC_F_GPIO_EN_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_EN_20_POS (20)

/* EN 21 */
#define MXC_F_GPIO_EN_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_EN_21_POS (21)

/* EN 22 */
#define MXC_F_GPIO_EN_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_EN_22_POS (22)

/* EN 23 */
#define MXC_F_GPIO_EN_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_EN_23_POS (23)

/* EN 24 */
#define MXC_F_GPIO_EN_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_EN_24_POS (24)

/* EN 25 */
#define MXC_F_GPIO_EN_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_EN_25_POS (25)

/* EN 26 */
#define MXC_F_GPIO_EN_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_EN_26_POS (26)

/* EN 27 */
#define MXC_F_GPIO_EN_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_EN_27_POS (27)

/* EN 28 */
#define MXC_F_GPIO_EN_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_EN_28_POS (28)

/* EN 29 */
#define MXC_F_GPIO_EN_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_EN_29_POS (29)

/* EN 30 */
#define MXC_F_GPIO_EN_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_EN_30_POS (30)

/* EN 31 */
#define MXC_F_GPIO_EN_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_EN_31_POS (31)

/* OUT_EN 00 */
#define MXC_F_GPIO_OUT_EN_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_OUT_EN_00_POS (0)

/* OUT_EN 01 */
#define MXC_F_GPIO_OUT_EN_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_OUT_EN_01_POS (1)

/* OUT_EN 02 */
#define MXC_F_GPIO_OUT_EN_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_OUT_EN_02_POS (2)

/* OUT_EN 03 */
#define MXC_F_GPIO_OUT_EN_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_OUT_EN_03_POS (3)

/* OUT_EN 04 */
#define MXC_F_GPIO_OUT_EN_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_OUT_EN_04_POS (4)

/* OUT_EN 05 */
#define MXC_F_GPIO_OUT_EN_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_OUT_EN_05_POS (5)

/* OUT_EN 06 */
#define MXC_F_GPIO_OUT_EN_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_OUT_EN_06_POS (6)

/* OUT_EN 07 */
#define MXC_F_GPIO_OUT_EN_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_OUT_EN_07_POS (7)

/* OUT_EN 08 */
#define MXC_F_GPIO_OUT_EN_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_OUT_EN_08_POS (8)

/* OUT_EN 09 */
#define MXC_F_GPIO_OUT_EN_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_OUT_EN_09_POS (9)

/* OUT_EN 10 */
#define MXC_F_GPIO_OUT_EN_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_OUT_EN_10_POS (10)

/* OUT_EN 11 */
#define MXC_F_GPIO_OUT_EN_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_OUT_EN_11_POS (11)

/* OUT_EN 12 */
#define MXC_F_GPIO_OUT_EN_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_OUT_EN_12_POS (12)

/* OUT_EN 13 */
#define MXC_F_GPIO_OUT_EN_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_OUT_EN_13_POS (13)

/* OUT_EN 14 */
#define MXC_F_GPIO_OUT_EN_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_OUT_EN_14_POS (14)

/* OUT_EN 15 */
#define MXC_F_GPIO_OUT_EN_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_OUT_EN_15_POS (15)

/* OUT_EN 16 */
#define MXC_F_GPIO_OUT_EN_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_OUT_EN_16_POS (16)

/* OUT_EN 17 */
#define MXC_F_GPIO_OUT_EN_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_OUT_EN_17_POS (17)

/* OUT_EN 18 */
#define MXC_F_GPIO_OUT_EN_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_OUT_EN_18_POS (18)

/* OUT_EN 19 */
#define MXC_F_GPIO_OUT_EN_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_OUT_EN_19_POS (19)

/* OUT_EN 20 */
#define MXC_F_GPIO_OUT_EN_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_OUT_EN_20_POS (20)

/* OUT_EN 21 */
#define MXC_F_GPIO_OUT_EN_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_OUT_EN_21_POS (21)

/* OUT_EN 22 */
#define MXC_F_GPIO_OUT_EN_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_OUT_EN_22_POS (22)

/* OUT_EN 23 */
#define MXC_F_GPIO_OUT_EN_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_OUT_EN_23_POS (23)

/* OUT_EN 24 */
#define MXC_F_GPIO_OUT_EN_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_OUT_EN_24_POS (24)

/* OUT_EN 25 */
#define MXC_F_GPIO_OUT_EN_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_OUT_EN_25_POS (25)

/* OUT_EN 26 */
#define MXC_F_GPIO_OUT_EN_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_OUT_EN_26_POS (26)

/* OUT_EN 27 */
#define MXC_F_GPIO_OUT_EN_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_OUT_EN_27_POS (27)

/* OUT_EN 28 */
#define MXC_F_GPIO_OUT_EN_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_OUT_EN_28_POS (28)

/* OUT_EN 29 */
#define MXC_F_GPIO_OUT_EN_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_OUT_EN_29_POS (29)

/* OUT_EN 30 */
#define MXC_F_GPIO_OUT_EN_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_OUT_EN_30_POS (30)

/* OUT_EN 31 */
#define MXC_F_GPIO_OUT_EN_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_OUT_EN_31_POS (31)

/* OUT 00 */
#define MXC_F_GPIO_OUT_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_OUT_00_POS (0)

/* OUT 01 */
#define MXC_F_GPIO_OUT_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_OUT_01_POS (1)

/* OUT 02 */
#define MXC_F_GPIO_OUT_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_OUT_02_POS (2)

/* OUT 03 */
#define MXC_F_GPIO_OUT_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_OUT_03_POS (3)

/* OUT 04 */
#define MXC_F_GPIO_OUT_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_OUT_04_POS (4)

/* OUT 05 */
#define MXC_F_GPIO_OUT_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_OUT_05_POS (5)

/* OUT 06 */
#define MXC_F_GPIO_OUT_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_OUT_06_POS (6)

