jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* OUT 07 */
#define MXC_F_GPIO_OUT_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_OUT_07_POS (7)

/* OUT 08 */
#define MXC_F_GPIO_OUT_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_OUT_08_POS (8)

/* OUT 09 */
#define MXC_F_GPIO_OUT_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_OUT_09_POS (9)

/* OUT 10 */
#define MXC_F_GPIO_OUT_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_OUT_10_POS (10)

/* OUT 11 */
#define MXC_F_GPIO_OUT_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_OUT_11_POS (11)

/* OUT 12 */
#define MXC_F_GPIO_OUT_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_OUT_12_POS (12)

/* OUT 13 */
#define MXC_F_GPIO_OUT_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_OUT_13_POS (13)

/* OUT 14 */
#define MXC_F_GPIO_OUT_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_OUT_14_POS (14)

/* OUT 15 */
#define MXC_F_GPIO_OUT_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_OUT_15_POS (15)

/* OUT 16 */
#define MXC_F_GPIO_OUT_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_OUT_16_POS (16)

/* OUT 17 */
#define MXC_F_GPIO_OUT_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_OUT_17_POS (17)

/* OUT 18 */
#define MXC_F_GPIO_OUT_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_OUT_18_POS (18)

/* OUT 19 */
#define MXC_F_GPIO_OUT_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_OUT_19_POS (19)

/* OUT 20 */
#define MXC_F_GPIO_OUT_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_OUT_20_POS (20)

/* OUT 21 */
#define MXC_F_GPIO_OUT_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_OUT_21_POS (21)

/* OUT 22 */
#define MXC_F_GPIO_OUT_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_OUT_22_POS (22)

/* OUT 23 */
#define MXC_F_GPIO_OUT_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_OUT_23_POS (23)

/* OUT 24 */
#define MXC_F_GPIO_OUT_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_OUT_24_POS (24)

/* OUT 25 */
#define MXC_F_GPIO_OUT_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_OUT_25_POS (25)

/* OUT 26 */
#define MXC_F_GPIO_OUT_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_OUT_26_POS (26)

/* OUT 27 */
#define MXC_F_GPIO_OUT_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_OUT_27_POS (27)

/* OUT 28 */
#define MXC_F_GPIO_OUT_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_OUT_28_POS (28)

/* OUT 29 */
#define MXC_F_GPIO_OUT_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_OUT_29_POS (29)

/* OUT 30 */
#define MXC_F_GPIO_OUT_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_OUT_30_POS (30)

/* OUT 31 */
#define MXC_F_GPIO_OUT_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_OUT_31_POS (31)

/* OUT_SET 00 */
#define MXC_F_GPIO_OUT_SET_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_OUT_SET_00_POS (0)

/* OUT_SET 01 */
#define MXC_F_GPIO_OUT_SET_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_OUT_SET_01_POS (1)

/* OUT_SET 02 */
#define MXC_F_GPIO_OUT_SET_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_OUT_SET_02_POS (2)

/* OUT_SET 03 */
#define MXC_F_GPIO_OUT_SET_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_OUT_SET_03_POS (3)

/* OUT_SET 04 */
#define MXC_F_GPIO_OUT_SET_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_OUT_SET_04_POS (4)

/* OUT_SET 05 */
#define MXC_F_GPIO_OUT_SET_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_OUT_SET_05_POS (5)

/* OUT_SET 06 */
#define MXC_F_GPIO_OUT_SET_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_OUT_SET_06_POS (6)

/* OUT_SET 07 */
#define MXC_F_GPIO_OUT_SET_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_OUT_SET_07_POS (7)

/* OUT_SET 08 */
#define MXC_F_GPIO_OUT_SET_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_OUT_SET_08_POS (8)

/* OUT_SET 09 */
#define MXC_F_GPIO_OUT_SET_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_OUT_SET_09_POS (9)

/* OUT_SET 10 */
#define MXC_F_GPIO_OUT_SET_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_OUT_SET_10_POS (10)

/* OUT_SET 11 */
#define MXC_F_GPIO_OUT_SET_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_OUT_SET_11_POS (11)

/* OUT_SET 12 */
#define MXC_F_GPIO_OUT_SET_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_OUT_SET_12_POS (12)

/* OUT_SET 13 */
#define MXC_F_GPIO_OUT_SET_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_OUT_SET_13_POS (13)

/* OUT_SET 14 */
#define MXC_F_GPIO_OUT_SET_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_OUT_SET_14_POS (14)

/* OUT_SET 15 */
#define MXC_F_GPIO_OUT_SET_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_OUT_SET_15_POS (15)

/* OUT_SET 16 */
#define MXC_F_GPIO_OUT_SET_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_OUT_SET_16_POS (16)

/* OUT_SET 17 */
#define MXC_F_GPIO_OUT_SET_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_OUT_SET_17_POS (17)

/* OUT_SET 18 */
#define MXC_F_GPIO_OUT_SET_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_OUT_SET_18_POS (18)

/* OUT_SET 19 */
#define MXC_F_GPIO_OUT_SET_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_OUT_SET_19_POS (19)

/* OUT_SET 20 */
#define MXC_F_GPIO_OUT_SET_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_OUT_SET_20_POS (20)

/* OUT_SET 21 */
#define MXC_F_GPIO_OUT_SET_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_OUT_SET_21_POS (21)

/* OUT_SET 22 */
#define MXC_F_GPIO_OUT_SET_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_OUT_SET_22_POS (22)

/* OUT_SET 23 */
#define MXC_F_GPIO_OUT_SET_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_OUT_SET_23_POS (23)

/* OUT_SET 24 */
#define MXC_F_GPIO_OUT_SET_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_OUT_SET_24_POS (24)

/* OUT_SET 25 */
#define MXC_F_GPIO_OUT_SET_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_OUT_SET_25_POS (25)

/* OUT_SET 26 */
#define MXC_F_GPIO_OUT_SET_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_OUT_SET_26_POS (26)

/* OUT_SET 27 */
#define MXC_F_GPIO_OUT_SET_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_OUT_SET_27_POS (27)

/* OUT_SET 28 */
#define MXC_F_GPIO_OUT_SET_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_OUT_SET_28_POS (28)

/* OUT_SET 29 */
#define MXC_F_GPIO_OUT_SET_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_OUT_SET_29_POS (29)

/* OUT_SET 30 */
#define MXC_F_GPIO_OUT_SET_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_OUT_SET_30_POS (30)

