jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* OUT_SET 31 */
#define MXC_F_GPIO_OUT_SET_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_OUT_SET_31_POS (31)

/* OUT_CLR 00 */
#define MXC_F_GPIO_OUT_CLR_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_OUT_CLR_00_POS (0)

/* OUT_CLR 01 */
#define MXC_F_GPIO_OUT_CLR_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_OUT_CLR_01_POS (1)

/* OUT_CLR 02 */
#define MXC_F_GPIO_OUT_CLR_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_OUT_CLR_02_POS (2)

/* OUT_CLR 03 */
#define MXC_F_GPIO_OUT_CLR_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_OUT_CLR_03_POS (3)

/* OUT_CLR 04 */
#define MXC_F_GPIO_OUT_CLR_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_OUT_CLR_04_POS (4)

/* OUT_CLR 05 */
#define MXC_F_GPIO_OUT_CLR_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_OUT_CLR_05_POS (5)

/* OUT_CLR 06 */
#define MXC_F_GPIO_OUT_CLR_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_OUT_CLR_06_POS (6)

/* OUT_CLR 07 */
#define MXC_F_GPIO_OUT_CLR_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_OUT_CLR_07_POS (7)

/* OUT_CLR 08 */
#define MXC_F_GPIO_OUT_CLR_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_OUT_CLR_08_POS (8)

/* OUT_CLR 09 */
#define MXC_F_GPIO_OUT_CLR_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_OUT_CLR_09_POS (9)

/* OUT_CLR 10 */
#define MXC_F_GPIO_OUT_CLR_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_OUT_CLR_10_POS (10)

/* OUT_CLR 11 */
#define MXC_F_GPIO_OUT_CLR_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_OUT_CLR_11_POS (11)

/* OUT_CLR 12 */
#define MXC_F_GPIO_OUT_CLR_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_OUT_CLR_12_POS (12)

/* OUT_CLR 13 */
#define MXC_F_GPIO_OUT_CLR_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_OUT_CLR_13_POS (13)

/* OUT_CLR 14 */
#define MXC_F_GPIO_OUT_CLR_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_OUT_CLR_14_POS (14)

/* OUT_CLR 15 */
#define MXC_F_GPIO_OUT_CLR_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_OUT_CLR_15_POS (15)

/* OUT_CLR 16 */
#define MXC_F_GPIO_OUT_CLR_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_OUT_CLR_16_POS (16)

/* OUT_CLR 17 */
#define MXC_F_GPIO_OUT_CLR_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_OUT_CLR_17_POS (17)

/* OUT_CLR 18 */
#define MXC_F_GPIO_OUT_CLR_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_OUT_CLR_18_POS (18)

/* OUT_CLR 19 */
#define MXC_F_GPIO_OUT_CLR_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_OUT_CLR_19_POS (19)

/* OUT_CLR 20 */
#define MXC_F_GPIO_OUT_CLR_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_OUT_CLR_20_POS (20)

/* OUT_CLR 21 */
#define MXC_F_GPIO_OUT_CLR_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_OUT_CLR_21_POS (21)

/* OUT_CLR 22 */
#define MXC_F_GPIO_OUT_CLR_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_OUT_CLR_22_POS (22)

/* OUT_CLR 23 */
#define MXC_F_GPIO_OUT_CLR_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_OUT_CLR_23_POS (23)

/* OUT_CLR 24 */
#define MXC_F_GPIO_OUT_CLR_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_OUT_CLR_24_POS (24)

/* OUT_CLR 25 */
#define MXC_F_GPIO_OUT_CLR_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_OUT_CLR_25_POS (25)

/* OUT_CLR 26 */
#define MXC_F_GPIO_OUT_CLR_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_OUT_CLR_26_POS (26)

/* OUT_CLR 27 */
#define MXC_F_GPIO_OUT_CLR_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_OUT_CLR_27_POS (27)

/* OUT_CLR 28 */
#define MXC_F_GPIO_OUT_CLR_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_OUT_CLR_28_POS (28)

/* OUT_CLR 29 */
#define MXC_F_GPIO_OUT_CLR_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_OUT_CLR_29_POS (29)

/* OUT_CLR 30 */
#define MXC_F_GPIO_OUT_CLR_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_OUT_CLR_30_POS (30)

/* OUT_CLR 31 */
#define MXC_F_GPIO_OUT_CLR_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_OUT_CLR_31_POS (31)

/* IN 00 */
#define MXC_F_GPIO_IN_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_IN_00_POS (0)

/* IN 01 */
#define MXC_F_GPIO_IN_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_IN_01_POS (1)

/* IN 02 */
#define MXC_F_GPIO_IN_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_IN_02_POS (2)

/* IN 03 */
#define MXC_F_GPIO_IN_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_IN_03_POS (3)

/* IN 04 */
#define MXC_F_GPIO_IN_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_IN_04_POS (4)

/* IN 05 */
#define MXC_F_GPIO_IN_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_IN_05_POS (5)

/* IN 06 */
#define MXC_F_GPIO_IN_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_IN_06_POS (6)

/* IN 07 */
#define MXC_F_GPIO_IN_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_IN_07_POS (7)

/* IN 08 */
#define MXC_F_GPIO_IN_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_IN_08_POS (8)

/* IN 09 */
#define MXC_F_GPIO_IN_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_IN_09_POS (9)

/* IN 10 */
#define MXC_F_GPIO_IN_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_IN_10_POS (10)

/* IN 11 */
#define MXC_F_GPIO_IN_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_IN_11_POS (11)

/* IN 12 */
#define MXC_F_GPIO_IN_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_IN_12_POS (12)

/* IN 13 */
#define MXC_F_GPIO_IN_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_IN_13_POS (13)

/* IN 14 */
#define MXC_F_GPIO_IN_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_IN_14_POS (14)

/* IN 15 */
#define MXC_F_GPIO_IN_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_IN_15_POS (15)

/* IN 16 */
#define MXC_F_GPIO_IN_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_IN_16_POS (16)

/* IN 17 */
#define MXC_F_GPIO_IN_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_IN_17_POS (17)

/* IN 18 */
#define MXC_F_GPIO_IN_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_IN_18_POS (18)

/* IN 19 */
#define MXC_F_GPIO_IN_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_IN_19_POS (19)

/* IN 20 */
#define MXC_F_GPIO_IN_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_IN_20_POS (20)

/* IN 21 */
#define MXC_F_GPIO_IN_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_IN_21_POS (21)

/* IN 22 */
#define MXC_F_GPIO_IN_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_IN_22_POS (22)

/* IN 23 */
#define MXC_F_GPIO_IN_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_IN_23_POS (23)

/* IN 24 */
#define MXC_F_GPIO_IN_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_IN_24_POS (24)

/* IN 25 */
#define MXC_F_GPIO_IN_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_IN_25_POS (25)

/* IN 26 */
#define MXC_F_GPIO_IN_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_IN_26_POS (26)

