jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* IN 27 */
#define MXC_F_GPIO_IN_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_IN_27_POS (27)

/* IN 28 */
#define MXC_F_GPIO_IN_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_IN_28_POS (28)

/* IN 29 */
#define MXC_F_GPIO_IN_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_IN_29_POS (29)

/* IN 30 */
#define MXC_F_GPIO_IN_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_IN_30_POS (30)

/* IN 31 */
#define MXC_F_GPIO_IN_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_IN_31_POS (31)

/* INT_MOD 00 */
#define MXC_F_GPIO_INT_MOD_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_INT_MOD_00_POS (0)

/* INT_MOD 01 */
#define MXC_F_GPIO_INT_MOD_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_INT_MOD_01_POS (1)

/* INT_MOD 02 */
#define MXC_F_GPIO_INT_MOD_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_INT_MOD_02_POS (2)

/* INT_MOD 03 */
#define MXC_F_GPIO_INT_MOD_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_INT_MOD_03_POS (3)

/* INT_MOD 04 */
#define MXC_F_GPIO_INT_MOD_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_INT_MOD_04_POS (4)

/* INT_MOD 05 */
#define MXC_F_GPIO_INT_MOD_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_INT_MOD_05_POS (5)

/* INT_MOD 06 */
#define MXC_F_GPIO_INT_MOD_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_INT_MOD_06_POS (6)

/* INT_MOD 07 */
#define MXC_F_GPIO_INT_MOD_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_INT_MOD_07_POS (7)

/* INT_MOD 08 */
#define MXC_F_GPIO_INT_MOD_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_INT_MOD_08_POS (8)

/* INT_MOD 09 */
#define MXC_F_GPIO_INT_MOD_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_INT_MOD_09_POS (9)

/* INT_MOD 10 */
#define MXC_F_GPIO_INT_MOD_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_INT_MOD_10_POS (10)

/* INT_MOD 11 */
#define MXC_F_GPIO_INT_MOD_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_INT_MOD_11_POS (11)

/* INT_MOD 12 */
#define MXC_F_GPIO_INT_MOD_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_INT_MOD_12_POS (12)

/* INT_MOD 13 */
#define MXC_F_GPIO_INT_MOD_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_INT_MOD_13_POS (13)

/* INT_MOD 14 */
#define MXC_F_GPIO_INT_MOD_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_INT_MOD_14_POS (14)

/* INT_MOD 15 */
#define MXC_F_GPIO_INT_MOD_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_INT_MOD_15_POS (15)

/* INT_MOD 16 */
#define MXC_F_GPIO_INT_MOD_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_INT_MOD_16_POS (16)

/* INT_MOD 17 */
#define MXC_F_GPIO_INT_MOD_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_INT_MOD_17_POS (17)

/* INT_MOD 18 */
#define MXC_F_GPIO_INT_MOD_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_INT_MOD_18_POS (18)

/* INT_MOD 19 */
#define MXC_F_GPIO_INT_MOD_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_INT_MOD_19_POS (19)

/* INT_MOD 20 */
#define MXC_F_GPIO_INT_MOD_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_INT_MOD_20_POS (20)

/* INT_MOD 21 */
#define MXC_F_GPIO_INT_MOD_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_INT_MOD_21_POS (21)

/* INT_MOD 22 */
#define MXC_F_GPIO_INT_MOD_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_INT_MOD_22_POS (22)

/* INT_MOD 23 */
#define MXC_F_GPIO_INT_MOD_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_INT_MOD_23_POS (23)

/* INT_MOD 24 */
#define MXC_F_GPIO_INT_MOD_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_INT_MOD_24_POS (24)

/* INT_MOD 25 */
#define MXC_F_GPIO_INT_MOD_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_INT_MOD_25_POS (25)

/* INT_MOD 26 */
#define MXC_F_GPIO_INT_MOD_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_INT_MOD_26_POS (26)

/* INT_MOD 27 */
#define MXC_F_GPIO_INT_MOD_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_INT_MOD_27_POS (27)

/* INT_MOD 28 */
#define MXC_F_GPIO_INT_MOD_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_INT_MOD_28_POS (28)

/* INT_MOD 29 */
#define MXC_F_GPIO_INT_MOD_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_INT_MOD_29_POS (29)

/* INT_MOD 30 */
#define MXC_F_GPIO_INT_MOD_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_INT_MOD_30_POS (30)

/* INT_MOD 31 */
#define MXC_F_GPIO_INT_MOD_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_INT_MOD_31_POS (31)

/* INT_POL 00 */
#define MXC_F_GPIO_INT_POL_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_INT_POL_00_POS (0)

/* INT_POL 01 */
#define MXC_F_GPIO_INT_POL_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_INT_POL_01_POS (1)

/* INT_POL 02 */
#define MXC_F_GPIO_INT_POL_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_INT_POL_02_POS (2)

/* INT_POL 03 */
#define MXC_F_GPIO_INT_POL_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_INT_POL_03_POS (3)

/* INT_POL 04 */
#define MXC_F_GPIO_INT_POL_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_INT_POL_04_POS (4)

/* INT_POL 05 */
#define MXC_F_GPIO_INT_POL_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_INT_POL_05_POS (5)

/* INT_POL 06 */
#define MXC_F_GPIO_INT_POL_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_INT_POL_06_POS (6)

/* INT_POL 07 */
#define MXC_F_GPIO_INT_POL_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_INT_POL_07_POS (7)

/* INT_POL 08 */
#define MXC_F_GPIO_INT_POL_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_INT_POL_08_POS (8)

/* INT_POL 09 */
#define MXC_F_GPIO_INT_POL_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_INT_POL_09_POS (9)

/* INT_POL 10 */
#define MXC_F_GPIO_INT_POL_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_INT_POL_10_POS (10)

/* INT_POL 11 */
#define MXC_F_GPIO_INT_POL_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_INT_POL_11_POS (11)

/* INT_POL 12 */
#define MXC_F_GPIO_INT_POL_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_INT_POL_12_POS (12)

/* INT_POL 13 */
#define MXC_F_GPIO_INT_POL_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_INT_POL_13_POS (13)

/* INT_POL 14 */
#define MXC_F_GPIO_INT_POL_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_INT_POL_14_POS (14)

/* INT_POL 15 */
#define MXC_F_GPIO_INT_POL_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_INT_POL_15_POS (15)

/* INT_POL 16 */
#define MXC_F_GPIO_INT_POL_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_INT_POL_16_POS (16)

/* INT_POL 17 */
#define MXC_F_GPIO_INT_POL_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_INT_POL_17_POS (17)

/* INT_POL 18 */
#define MXC_F_GPIO_INT_POL_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_INT_POL_18_POS (18)

