jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* INT_POL 19 */
#define MXC_F_GPIO_INT_POL_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_INT_POL_19_POS (19)

/* INT_POL 20 */
#define MXC_F_GPIO_INT_POL_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_INT_POL_20_POS (20)

/* INT_POL 21 */
#define MXC_F_GPIO_INT_POL_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_INT_POL_21_POS (21)

/* INT_POL 22 */
#define MXC_F_GPIO_INT_POL_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_INT_POL_22_POS (22)

/* INT_POL 23 */
#define MXC_F_GPIO_INT_POL_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_INT_POL_23_POS (23)

/* INT_POL 24 */
#define MXC_F_GPIO_INT_POL_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_INT_POL_24_POS (24)

/* INT_POL 25 */
#define MXC_F_GPIO_INT_POL_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_INT_POL_25_POS (25)

/* INT_POL 26 */
#define MXC_F_GPIO_INT_POL_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_INT_POL_26_POS (26)

/* INT_POL 27 */
#define MXC_F_GPIO_INT_POL_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_INT_POL_27_POS (27)

/* INT_POL 28 */
#define MXC_F_GPIO_INT_POL_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_INT_POL_28_POS (28)

/* INT_POL 29 */
#define MXC_F_GPIO_INT_POL_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_INT_POL_29_POS (29)

/* INT_POL 30 */
#define MXC_F_GPIO_INT_POL_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_INT_POL_30_POS (30)

/* INT_POL 31 */
#define MXC_F_GPIO_INT_POL_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_INT_POL_31_POS (31)

/* INT_EN 00 */
#define MXC_F_GPIO_INT_EN_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_INT_EN_00_POS (0)

/* INT_EN 01 */
#define MXC_F_GPIO_INT_EN_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_INT_EN_01_POS (1)

/* INT_EN 02 */
#define MXC_F_GPIO_INT_EN_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_INT_EN_02_POS (2)

/* INT_EN 03 */
#define MXC_F_GPIO_INT_EN_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_INT_EN_03_POS (3)

/* INT_EN 04 */
#define MXC_F_GPIO_INT_EN_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_INT_EN_04_POS (4)

/* INT_EN 05 */
#define MXC_F_GPIO_INT_EN_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_INT_EN_05_POS (5)

/* INT_EN 06 */
#define MXC_F_GPIO_INT_EN_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_INT_EN_06_POS (6)

/* INT_EN 07 */
#define MXC_F_GPIO_INT_EN_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_INT_EN_07_POS (7)

/* INT_EN 08 */
#define MXC_F_GPIO_INT_EN_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_INT_EN_08_POS (8)

/* INT_EN 09 */
#define MXC_F_GPIO_INT_EN_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_INT_EN_09_POS (9)

/* INT_EN 10 */
#define MXC_F_GPIO_INT_EN_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_INT_EN_10_POS (10)

/* INT_EN 11 */
#define MXC_F_GPIO_INT_EN_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_INT_EN_11_POS (11)

/* INT_EN 12 */
#define MXC_F_GPIO_INT_EN_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_INT_EN_12_POS (12)

/* INT_EN 13 */
#define MXC_F_GPIO_INT_EN_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_INT_EN_13_POS (13)

/* INT_EN 14 */
#define MXC_F_GPIO_INT_EN_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_INT_EN_14_POS (14)

/* INT_EN 15 */
#define MXC_F_GPIO_INT_EN_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_INT_EN_15_POS (15)

/* INT_EN 16 */
#define MXC_F_GPIO_INT_EN_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_INT_EN_16_POS (16)

/* INT_EN 17 */
#define MXC_F_GPIO_INT_EN_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_INT_EN_17_POS (17)

/* INT_EN 18 */
#define MXC_F_GPIO_INT_EN_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_INT_EN_18_POS (18)

/* INT_EN 19 */
#define MXC_F_GPIO_INT_EN_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_INT_EN_19_POS (19)

/* INT_EN 20 */
#define MXC_F_GPIO_INT_EN_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_INT_EN_20_POS (20)

/* INT_EN 21 */
#define MXC_F_GPIO_INT_EN_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_INT_EN_21_POS (21)

/* INT_EN 22 */
#define MXC_F_GPIO_INT_EN_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_INT_EN_22_POS (22)

/* INT_EN 23 */
#define MXC_F_GPIO_INT_EN_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_INT_EN_23_POS (23)

/* INT_EN 24 */
#define MXC_F_GPIO_INT_EN_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_INT_EN_24_POS (24)

/* INT_EN 25 */
#define MXC_F_GPIO_INT_EN_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_INT_EN_25_POS (25)

/* INT_EN 26 */
#define MXC_F_GPIO_INT_EN_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_INT_EN_26_POS (26)

/* INT_EN 27 */
#define MXC_F_GPIO_INT_EN_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_INT_EN_27_POS (27)

/* INT_EN 28 */
#define MXC_F_GPIO_INT_EN_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_INT_EN_28_POS (28)

/* INT_EN 29 */
#define MXC_F_GPIO_INT_EN_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_INT_EN_29_POS (29)

/* INT_EN 30 */
#define MXC_F_GPIO_INT_EN_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_INT_EN_30_POS (30)

/* INT_EN 31 */
#define MXC_F_GPIO_INT_EN_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_INT_EN_31_POS (31)

/* INT_EN_SET 00 */
#define MXC_F_GPIO_INT_EN_SET_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_INT_EN_SET_00_POS (0)

/* INT_EN_SET 01 */
#define MXC_F_GPIO_INT_EN_SET_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_INT_EN_SET_01_POS (1)

/* INT_EN_SET 02 */
#define MXC_F_GPIO_INT_EN_SET_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_INT_EN_SET_02_POS (2)

/* INT_EN_SET 03 */
#define MXC_F_GPIO_INT_EN_SET_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_INT_EN_SET_03_POS (3)

/* INT_EN_SET 04 */
#define MXC_F_GPIO_INT_EN_SET_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_INT_EN_SET_04_POS (4)

/* INT_EN_SET 05 */
#define MXC_F_GPIO_INT_EN_SET_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_INT_EN_SET_05_POS (5)

/* INT_EN_SET 06 */
#define MXC_F_GPIO_INT_EN_SET_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_INT_EN_SET_06_POS (6)

/* INT_EN_SET 07 */
#define MXC_F_GPIO_INT_EN_SET_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_INT_EN_SET_07_POS (7)

/* INT_EN_SET 08 */
#define MXC_F_GPIO_INT_EN_SET_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_INT_EN_SET_08_POS (8)

/* INT_EN_SET 09 */
#define MXC_F_GPIO_INT_EN_SET_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_INT_EN_SET_09_POS (9)

