jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* INT_EN_SET 10 */
#define MXC_F_GPIO_INT_EN_SET_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_INT_EN_SET_10_POS (10)

/* INT_EN_SET 11 */
#define MXC_F_GPIO_INT_EN_SET_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_INT_EN_SET_11_POS (11)

/* INT_EN_SET 12 */
#define MXC_F_GPIO_INT_EN_SET_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_INT_EN_SET_12_POS (12)

/* INT_EN_SET 13 */
#define MXC_F_GPIO_INT_EN_SET_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_INT_EN_SET_13_POS (13)

/* INT_EN_SET 14 */
#define MXC_F_GPIO_INT_EN_SET_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_INT_EN_SET_14_POS (14)

/* INT_EN_SET 15 */
#define MXC_F_GPIO_INT_EN_SET_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_INT_EN_SET_15_POS (15)

/* INT_EN_SET 16 */
#define MXC_F_GPIO_INT_EN_SET_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_INT_EN_SET_16_POS (16)

/* INT_EN_SET 17 */
#define MXC_F_GPIO_INT_EN_SET_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_INT_EN_SET_17_POS (17)

/* INT_EN_SET 18 */
#define MXC_F_GPIO_INT_EN_SET_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_INT_EN_SET_18_POS (18)

/* INT_EN_SET 19 */
#define MXC_F_GPIO_INT_EN_SET_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_INT_EN_SET_19_POS (19)

/* INT_EN_SET 20 */
#define MXC_F_GPIO_INT_EN_SET_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_INT_EN_SET_20_POS (20)

/* INT_EN_SET 21 */
#define MXC_F_GPIO_INT_EN_SET_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_INT_EN_SET_21_POS (21)

/* INT_EN_SET 22 */
#define MXC_F_GPIO_INT_EN_SET_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_INT_EN_SET_22_POS (22)

/* INT_EN_SET 23 */
#define MXC_F_GPIO_INT_EN_SET_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_INT_EN_SET_23_POS (23)

/* INT_EN_SET 24 */
#define MXC_F_GPIO_INT_EN_SET_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_INT_EN_SET_24_POS (24)

/* INT_EN_SET 25 */
#define MXC_F_GPIO_INT_EN_SET_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_INT_EN_SET_25_POS (25)

/* INT_EN_SET 26 */
#define MXC_F_GPIO_INT_EN_SET_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_INT_EN_SET_26_POS (26)

/* INT_EN_SET 27 */
#define MXC_F_GPIO_INT_EN_SET_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_INT_EN_SET_27_POS (27)

/* INT_EN_SET 28 */
#define MXC_F_GPIO_INT_EN_SET_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_INT_EN_SET_28_POS (28)

/* INT_EN_SET 29 */
#define MXC_F_GPIO_INT_EN_SET_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_INT_EN_SET_29_POS (29)

/* INT_EN_SET 30 */
#define MXC_F_GPIO_INT_EN_SET_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_INT_EN_SET_30_POS (30)

/* INT_EN_SET 31 */
#define MXC_F_GPIO_INT_EN_SET_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_INT_EN_SET_31_POS (31)

/* INT_EN_CLR 00 */
#define MXC_F_GPIO_INT_EN_CLR_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_INT_EN_CLR_00_POS (0)

/* INT_EN_CLR 01 */
#define MXC_F_GPIO_INT_EN_CLR_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_INT_EN_CLR_01_POS (1)

/* INT_EN_CLR 02 */
#define MXC_F_GPIO_INT_EN_CLR_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_INT_EN_CLR_02_POS (2)

/* INT_EN_CLR 03 */
#define MXC_F_GPIO_INT_EN_CLR_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_INT_EN_CLR_03_POS (3)

/* INT_EN_CLR 04 */
#define MXC_F_GPIO_INT_EN_CLR_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_INT_EN_CLR_04_POS (4)

/* INT_EN_CLR 05 */
#define MXC_F_GPIO_INT_EN_CLR_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_INT_EN_CLR_05_POS (5)

/* INT_EN_CLR 06 */
#define MXC_F_GPIO_INT_EN_CLR_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_INT_EN_CLR_06_POS (6)

/* INT_EN_CLR 07 */
#define MXC_F_GPIO_INT_EN_CLR_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_INT_EN_CLR_07_POS (7)

/* INT_EN_CLR 08 */
#define MXC_F_GPIO_INT_EN_CLR_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_INT_EN_CLR_08_POS (8)

/* INT_EN_CLR 09 */
#define MXC_F_GPIO_INT_EN_CLR_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_INT_EN_CLR_09_POS (9)

/* INT_EN_CLR 10 */
#define MXC_F_GPIO_INT_EN_CLR_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_INT_EN_CLR_10_POS (10)

/* INT_EN_CLR 11 */
#define MXC_F_GPIO_INT_EN_CLR_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_INT_EN_CLR_11_POS (11)

/* INT_EN_CLR 12 */
#define MXC_F_GPIO_INT_EN_CLR_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_INT_EN_CLR_12_POS (12)

/* INT_EN_CLR 13 */
#define MXC_F_GPIO_INT_EN_CLR_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_INT_EN_CLR_13_POS (13)

/* INT_EN_CLR 14 */
#define MXC_F_GPIO_INT_EN_CLR_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_INT_EN_CLR_14_POS (14)

/* INT_EN_CLR 15 */
#define MXC_F_GPIO_INT_EN_CLR_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_INT_EN_CLR_15_POS (15)

/* INT_EN_CLR 16 */
#define MXC_F_GPIO_INT_EN_CLR_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_INT_EN_CLR_16_POS (16)

/* INT_EN_CLR 17 */
#define MXC_F_GPIO_INT_EN_CLR_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_INT_EN_CLR_17_POS (17)

/* INT_EN_CLR 18 */
#define MXC_F_GPIO_INT_EN_CLR_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_INT_EN_CLR_18_POS (18)

/* INT_EN_CLR 19 */
#define MXC_F_GPIO_INT_EN_CLR_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_INT_EN_CLR_19_POS (19)

/* INT_EN_CLR 20 */
#define MXC_F_GPIO_INT_EN_CLR_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_INT_EN_CLR_20_POS (20)

/* INT_EN_CLR 21 */
#define MXC_F_GPIO_INT_EN_CLR_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_INT_EN_CLR_21_POS (21)

/* INT_EN_CLR 22 */
#define MXC_F_GPIO_INT_EN_CLR_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_INT_EN_CLR_22_POS (22)

/* INT_EN_CLR 23 */
#define MXC_F_GPIO_INT_EN_CLR_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_INT_EN_CLR_23_POS (23)

/* INT_EN_CLR 24 */
#define MXC_F_GPIO_INT_EN_CLR_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_INT_EN_CLR_24_POS (24)

/* INT_EN_CLR 25 */
#define MXC_F_GPIO_INT_EN_CLR_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_INT_EN_CLR_25_POS (25)

/* INT_EN_CLR 26 */
#define MXC_F_GPIO_INT_EN_CLR_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_INT_EN_CLR_26_POS (26)

/* INT_EN_CLR 27 */
#define MXC_F_GPIO_INT_EN_CLR_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_INT_EN_CLR_27_POS (27)

/* INT_EN_CLR 28 */
#define MXC_F_GPIO_INT_EN_CLR_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_INT_EN_CLR_28_POS (28)

/* INT_EN_CLR 29 */
#define MXC_F_GPIO_INT_EN_CLR_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_INT_EN_CLR_29_POS (29)

