jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* INT_EN_CLR 30 */
#define MXC_F_GPIO_INT_EN_CLR_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_INT_EN_CLR_30_POS (30)

/* INT_EN_CLR 31 */
#define MXC_F_GPIO_INT_EN_CLR_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_INT_EN_CLR_31_POS (31)

/* INT_STAT 00 */
#define MXC_F_GPIO_INT_STAT_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_INT_STAT_00_POS (0)

/* INT_STAT 01 */
#define MXC_F_GPIO_INT_STAT_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_INT_STAT_01_POS (1)

/* INT_STAT 02 */
#define MXC_F_GPIO_INT_STAT_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_INT_STAT_02_POS (2)

/* INT_STAT 03 */
#define MXC_F_GPIO_INT_STAT_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_INT_STAT_03_POS (3)

/* INT_STAT 04 */
#define MXC_F_GPIO_INT_STAT_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_INT_STAT_04_POS (4)

/* INT_STAT 05 */
#define MXC_F_GPIO_INT_STAT_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_INT_STAT_05_POS (5)

/* INT_STAT 06 */
#define MXC_F_GPIO_INT_STAT_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_INT_STAT_06_POS (6)

/* INT_STAT 07 */
#define MXC_F_GPIO_INT_STAT_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_INT_STAT_07_POS (7)

/* INT_STAT 08 */
#define MXC_F_GPIO_INT_STAT_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_INT_STAT_08_POS (8)

/* INT_STAT 09 */
#define MXC_F_GPIO_INT_STAT_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_INT_STAT_09_POS (9)

/* INT_STAT 10 */
#define MXC_F_GPIO_INT_STAT_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_INT_STAT_10_POS (10)

/* INT_STAT 11 */
#define MXC_F_GPIO_INT_STAT_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_INT_STAT_11_POS (11)

/* INT_STAT 12 */
#define MXC_F_GPIO_INT_STAT_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_INT_STAT_12_POS (12)

/* INT_STAT 13 */
#define MXC_F_GPIO_INT_STAT_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_INT_STAT_13_POS (13)

/* INT_STAT 14 */
#define MXC_F_GPIO_INT_STAT_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_INT_STAT_14_POS (14)

/* INT_STAT 15 */
#define MXC_F_GPIO_INT_STAT_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_INT_STAT_15_POS (15)

/* INT_STAT 16 */
#define MXC_F_GPIO_INT_STAT_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_INT_STAT_16_POS (16)

/* INT_STAT 17 */
#define MXC_F_GPIO_INT_STAT_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_INT_STAT_17_POS (17)

/* INT_STAT 18 */
#define MXC_F_GPIO_INT_STAT_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_INT_STAT_18_POS (18)

/* INT_STAT 19 */
#define MXC_F_GPIO_INT_STAT_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_INT_STAT_19_POS (19)

/* INT_STAT 20 */
#define MXC_F_GPIO_INT_STAT_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_INT_STAT_20_POS (20)

/* INT_STAT 21 */
#define MXC_F_GPIO_INT_STAT_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_INT_STAT_21_POS (21)

/* INT_STAT 22 */
#define MXC_F_GPIO_INT_STAT_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_INT_STAT_22_POS (22)

/* INT_STAT 23 */
#define MXC_F_GPIO_INT_STAT_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_INT_STAT_23_POS (23)

/* INT_STAT 24 */
#define MXC_F_GPIO_INT_STAT_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_INT_STAT_24_POS (24)

/* INT_STAT 25 */
#define MXC_F_GPIO_INT_STAT_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_INT_STAT_25_POS (25)

/* INT_STAT 26 */
#define MXC_F_GPIO_INT_STAT_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_INT_STAT_26_POS (26)

/* INT_STAT 27 */
#define MXC_F_GPIO_INT_STAT_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_INT_STAT_27_POS (27)

/* INT_STAT 28 */
#define MXC_F_GPIO_INT_STAT_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_INT_STAT_28_POS (28)

/* INT_STAT 29 */
#define MXC_F_GPIO_INT_STAT_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_INT_STAT_29_POS (29)

/* INT_STAT 30 */
#define MXC_F_GPIO_INT_STAT_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_INT_STAT_30_POS (30)

/* INT_STAT 31 */
#define MXC_F_GPIO_INT_STAT_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_INT_STAT_31_POS (31)

/* INT_CLR 00 */
#define MXC_F_GPIO_INT_CLR_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_INT_CLR_00_POS (0)

/* INT_CLR 01 */
#define MXC_F_GPIO_INT_CLR_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_INT_CLR_01_POS (1)

/* INT_CLR 02 */
#define MXC_F_GPIO_INT_CLR_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_INT_CLR_02_POS (2)

/* INT_CLR 03 */
#define MXC_F_GPIO_INT_CLR_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_INT_CLR_03_POS (3)

/* INT_CLR 04 */
#define MXC_F_GPIO_INT_CLR_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_INT_CLR_04_POS (4)

/* INT_CLR 05 */
#define MXC_F_GPIO_INT_CLR_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_INT_CLR_05_POS (5)

/* INT_CLR 06 */
#define MXC_F_GPIO_INT_CLR_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_INT_CLR_06_POS (6)

/* INT_CLR 07 */
#define MXC_F_GPIO_INT_CLR_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_INT_CLR_07_POS (7)

/* INT_CLR 08 */
#define MXC_F_GPIO_INT_CLR_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_INT_CLR_08_POS (8)

/* INT_CLR 09 */
#define MXC_F_GPIO_INT_CLR_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_INT_CLR_09_POS (9)

/* INT_CLR 10 */
#define MXC_F_GPIO_INT_CLR_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_INT_CLR_10_POS (10)

/* INT_CLR 11 */
#define MXC_F_GPIO_INT_CLR_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_INT_CLR_11_POS (11)

/* INT_CLR 12 */
#define MXC_F_GPIO_INT_CLR_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_INT_CLR_12_POS (12)

/* INT_CLR 13 */
#define MXC_F_GPIO_INT_CLR_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_INT_CLR_13_POS (13)

/* INT_CLR 14 */
#define MXC_F_GPIO_INT_CLR_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_INT_CLR_14_POS (14)

/* INT_CLR 15 */
#define MXC_F_GPIO_INT_CLR_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_INT_CLR_15_POS (15)

/* INT_CLR 16 */
#define MXC_F_GPIO_INT_CLR_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_INT_CLR_16_POS (16)

/* INT_CLR 17 */
#define MXC_F_GPIO_INT_CLR_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_INT_CLR_17_POS (17)

/* INT_CLR 18 */
#define MXC_F_GPIO_INT_CLR_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_INT_CLR_18_POS (18)

