jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* INT_CLR 19 */
#define MXC_F_GPIO_INT_CLR_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_INT_CLR_19_POS (19)

/* INT_CLR 20 */
#define MXC_F_GPIO_INT_CLR_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_INT_CLR_20_POS (20)

/* INT_CLR 21 */
#define MXC_F_GPIO_INT_CLR_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_INT_CLR_21_POS (21)

/* INT_CLR 22 */
#define MXC_F_GPIO_INT_CLR_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_INT_CLR_22_POS (22)

/* INT_CLR 23 */
#define MXC_F_GPIO_INT_CLR_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_INT_CLR_23_POS (23)

/* INT_CLR 24 */
#define MXC_F_GPIO_INT_CLR_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_INT_CLR_24_POS (24)

/* INT_CLR 25 */
#define MXC_F_GPIO_INT_CLR_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_INT_CLR_25_POS (25)

/* INT_CLR 26 */
#define MXC_F_GPIO_INT_CLR_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_INT_CLR_26_POS (26)

/* INT_CLR 27 */
#define MXC_F_GPIO_INT_CLR_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_INT_CLR_27_POS (27)

/* INT_CLR 28 */
#define MXC_F_GPIO_INT_CLR_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_INT_CLR_28_POS (28)

/* INT_CLR 29 */
#define MXC_F_GPIO_INT_CLR_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_INT_CLR_29_POS (29)

/* INT_CLR 30 */
#define MXC_F_GPIO_INT_CLR_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_INT_CLR_30_POS (30)

/* INT_CLR 31 */
#define MXC_F_GPIO_INT_CLR_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_INT_CLR_31_POS (31)

/* WAKE_EN 00 */
#define MXC_F_GPIO_WAKE_EN_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_WAKE_EN_00_POS (0)

/* WAKE_EN 01 */
#define MXC_F_GPIO_WAKE_EN_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_WAKE_EN_01_POS (1)

/* WAKE_EN 02 */
#define MXC_F_GPIO_WAKE_EN_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_WAKE_EN_02_POS (2)

/* WAKE_EN 03 */
#define MXC_F_GPIO_WAKE_EN_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_WAKE_EN_03_POS (3)

/* WAKE_EN 04 */
#define MXC_F_GPIO_WAKE_EN_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_WAKE_EN_04_POS (4)

/* WAKE_EN 05 */
#define MXC_F_GPIO_WAKE_EN_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_WAKE_EN_05_POS (5)

/* WAKE_EN 06 */
#define MXC_F_GPIO_WAKE_EN_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_WAKE_EN_06_POS (6)

/* WAKE_EN 07 */
#define MXC_F_GPIO_WAKE_EN_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_WAKE_EN_07_POS (7)

/* WAKE_EN 08 */
#define MXC_F_GPIO_WAKE_EN_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_WAKE_EN_08_POS (8)

/* WAKE_EN 09 */
#define MXC_F_GPIO_WAKE_EN_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_WAKE_EN_09_POS (9)

/* WAKE_EN 10 */
#define MXC_F_GPIO_WAKE_EN_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_WAKE_EN_10_POS (10)

/* WAKE_EN 11 */
#define MXC_F_GPIO_WAKE_EN_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_WAKE_EN_11_POS (11)

/* WAKE_EN 12 */
#define MXC_F_GPIO_WAKE_EN_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_WAKE_EN_12_POS (12)

/* WAKE_EN 13 */
#define MXC_F_GPIO_WAKE_EN_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_WAKE_EN_13_POS (13)

/* WAKE_EN 14 */
#define MXC_F_GPIO_WAKE_EN_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_WAKE_EN_14_POS (14)

/* WAKE_EN 15 */
#define MXC_F_GPIO_WAKE_EN_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_WAKE_EN_15_POS (15)

/* WAKE_EN 16 */
#define MXC_F_GPIO_WAKE_EN_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_WAKE_EN_16_POS (16)

/* WAKE_EN 17 */
#define MXC_F_GPIO_WAKE_EN_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_WAKE_EN_17_POS (17)

/* WAKE_EN 18 */
#define MXC_F_GPIO_WAKE_EN_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_WAKE_EN_18_POS (18)

/* WAKE_EN 19 */
#define MXC_F_GPIO_WAKE_EN_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_WAKE_EN_19_POS (19)

/* WAKE_EN 20 */
#define MXC_F_GPIO_WAKE_EN_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_WAKE_EN_20_POS (20)

/* WAKE_EN 21 */
#define MXC_F_GPIO_WAKE_EN_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_WAKE_EN_21_POS (21)

/* WAKE_EN 22 */
#define MXC_F_GPIO_WAKE_EN_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_WAKE_EN_22_POS (22)

/* WAKE_EN 23 */
#define MXC_F_GPIO_WAKE_EN_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_WAKE_EN_23_POS (23)

/* WAKE_EN 24 */
#define MXC_F_GPIO_WAKE_EN_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_WAKE_EN_24_POS (24)

/* WAKE_EN 25 */
#define MXC_F_GPIO_WAKE_EN_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_WAKE_EN_25_POS (25)

/* WAKE_EN 26 */
#define MXC_F_GPIO_WAKE_EN_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_WAKE_EN_26_POS (26)

/* WAKE_EN 27 */
#define MXC_F_GPIO_WAKE_EN_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_WAKE_EN_27_POS (27)

/* WAKE_EN 28 */
#define MXC_F_GPIO_WAKE_EN_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_WAKE_EN_28_POS (28)

/* WAKE_EN 29 */
#define MXC_F_GPIO_WAKE_EN_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_WAKE_EN_29_POS (29)

/* WAKE_EN 30 */
#define MXC_F_GPIO_WAKE_EN_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_WAKE_EN_30_POS (30)

/* WAKE_EN 31 */
#define MXC_F_GPIO_WAKE_EN_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_WAKE_EN_31_POS (31)

/* INT_DUAL_EDGE 00 */
#define MXC_F_GPIO_INT_DUAL_EDGE_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_00_POS (0)

/* INT_DUAL_EDGE 01 */
#define MXC_F_GPIO_INT_DUAL_EDGE_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_01_POS (1)

/* INT_DUAL_EDGE 02 */
#define MXC_F_GPIO_INT_DUAL_EDGE_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_02_POS (2)

/* INT_DUAL_EDGE 03 */
#define MXC_F_GPIO_INT_DUAL_EDGE_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_03_POS (3)

/* INT_DUAL_EDGE 04 */
#define MXC_F_GPIO_INT_DUAL_EDGE_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_04_POS (4)

/* INT_DUAL_EDGE 05 */
#define MXC_F_GPIO_INT_DUAL_EDGE_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_05_POS (5)

/* INT_DUAL_EDGE 06 */
#define MXC_F_GPIO_INT_DUAL_EDGE_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_06_POS (6)

