jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* INT_DUAL_EDGE 07 */
#define MXC_F_GPIO_INT_DUAL_EDGE_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_07_POS (7)

/* INT_DUAL_EDGE 08 */
#define MXC_F_GPIO_INT_DUAL_EDGE_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_08_POS (8)

/* INT_DUAL_EDGE 09 */
#define MXC_F_GPIO_INT_DUAL_EDGE_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_09_POS (9)

/* INT_DUAL_EDGE 10 */
#define MXC_F_GPIO_INT_DUAL_EDGE_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_10_POS (10)

/* INT_DUAL_EDGE 11 */
#define MXC_F_GPIO_INT_DUAL_EDGE_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_11_POS (11)

/* INT_DUAL_EDGE 12 */
#define MXC_F_GPIO_INT_DUAL_EDGE_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_12_POS (12)

/* INT_DUAL_EDGE 13 */
#define MXC_F_GPIO_INT_DUAL_EDGE_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_13_POS (13)

/* INT_DUAL_EDGE 14 */
#define MXC_F_GPIO_INT_DUAL_EDGE_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_14_POS (14)

/* INT_DUAL_EDGE 15 */
#define MXC_F_GPIO_INT_DUAL_EDGE_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_15_POS (15)

/* INT_DUAL_EDGE 16 */
#define MXC_F_GPIO_INT_DUAL_EDGE_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_16_POS (16)

/* INT_DUAL_EDGE 17 */
#define MXC_F_GPIO_INT_DUAL_EDGE_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_17_POS (17)

/* INT_DUAL_EDGE 18 */
#define MXC_F_GPIO_INT_DUAL_EDGE_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_18_POS (18)

/* INT_DUAL_EDGE 19 */
#define MXC_F_GPIO_INT_DUAL_EDGE_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_19_POS (19)

/* INT_DUAL_EDGE 20 */
#define MXC_F_GPIO_INT_DUAL_EDGE_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_20_POS (20)

/* INT_DUAL_EDGE 21 */
#define MXC_F_GPIO_INT_DUAL_EDGE_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_21_POS (21)

/* INT_DUAL_EDGE 22 */
#define MXC_F_GPIO_INT_DUAL_EDGE_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_22_POS (22)

/* INT_DUAL_EDGE 23 */
#define MXC_F_GPIO_INT_DUAL_EDGE_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_23_POS (23)

/* INT_DUAL_EDGE 24 */
#define MXC_F_GPIO_INT_DUAL_EDGE_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_24_POS (24)

/* INT_DUAL_EDGE 25 */
#define MXC_F_GPIO_INT_DUAL_EDGE_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_25_POS (25)

/* INT_DUAL_EDGE 26 */
#define MXC_F_GPIO_INT_DUAL_EDGE_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_26_POS (26)

/* INT_DUAL_EDGE 27 */
#define MXC_F_GPIO_INT_DUAL_EDGE_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_27_POS (27)

/* INT_DUAL_EDGE 28 */
#define MXC_F_GPIO_INT_DUAL_EDGE_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_28_POS (28)

/* INT_DUAL_EDGE 29 */
#define MXC_F_GPIO_INT_DUAL_EDGE_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_29_POS (29)

/* INT_DUAL_EDGE 30 */
#define MXC_F_GPIO_INT_DUAL_EDGE_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_30_POS (30)

/* INT_DUAL_EDGE 31 */
#define MXC_F_GPIO_INT_DUAL_EDGE_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_INT_DUAL_EDGE_31_POS (31)

/* PAD_CFG1 00 */
#define MXC_F_GPIO_PAD_CFG1_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_PAD_CFG1_00_POS (0)

/* PAD_CFG1 01 */
#define MXC_F_GPIO_PAD_CFG1_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_PAD_CFG1_01_POS (1)

/* PAD_CFG1 02 */
#define MXC_F_GPIO_PAD_CFG1_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_PAD_CFG1_02_POS (2)

/* PAD_CFG1 03 */
#define MXC_F_GPIO_PAD_CFG1_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_PAD_CFG1_03_POS (3)

/* PAD_CFG1 04 */
#define MXC_F_GPIO_PAD_CFG1_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_PAD_CFG1_04_POS (4)

/* PAD_CFG1 05 */
#define MXC_F_GPIO_PAD_CFG1_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_PAD_CFG1_05_POS (5)

/* PAD_CFG1 06 */
#define MXC_F_GPIO_PAD_CFG1_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_PAD_CFG1_06_POS (6)

/* PAD_CFG1 07 */
#define MXC_F_GPIO_PAD_CFG1_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_PAD_CFG1_07_POS (7)

/* PAD_CFG1 08 */
#define MXC_F_GPIO_PAD_CFG1_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_PAD_CFG1_08_POS (8)

/* PAD_CFG1 09 */
#define MXC_F_GPIO_PAD_CFG1_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_PAD_CFG1_09_POS (9)

/* PAD_CFG1 10 */
#define MXC_F_GPIO_PAD_CFG1_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_PAD_CFG1_10_POS (10)

/* PAD_CFG1 11 */
#define MXC_F_GPIO_PAD_CFG1_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_PAD_CFG1_11_POS (11)

/* PAD_CFG1 12 */
#define MXC_F_GPIO_PAD_CFG1_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_PAD_CFG1_12_POS (12)

/* PAD_CFG1 13 */
#define MXC_F_GPIO_PAD_CFG1_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_PAD_CFG1_13_POS (13)

/* PAD_CFG1 14 */
#define MXC_F_GPIO_PAD_CFG1_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_PAD_CFG1_14_POS (14)

/* PAD_CFG1 15 */
#define MXC_F_GPIO_PAD_CFG1_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_PAD_CFG1_15_POS (15)

/* PAD_CFG1 16 */
#define MXC_F_GPIO_PAD_CFG1_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_PAD_CFG1_16_POS (16)

/* PAD_CFG1 17 */
#define MXC_F_GPIO_PAD_CFG1_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_PAD_CFG1_17_POS (17)

/* PAD_CFG1 18 */
#define MXC_F_GPIO_PAD_CFG1_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_PAD_CFG1_18_POS (18)

/* PAD_CFG1 19 */
#define MXC_F_GPIO_PAD_CFG1_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_PAD_CFG1_19_POS (19)

/* PAD_CFG1 20 */
#define MXC_F_GPIO_PAD_CFG1_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_PAD_CFG1_20_POS (20)

/* PAD_CFG1 21 */
#define MXC_F_GPIO_PAD_CFG1_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_PAD_CFG1_21_POS (21)

/* PAD_CFG1 22 */
#define MXC_F_GPIO_PAD_CFG1_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_PAD_CFG1_22_POS (22)

/* PAD_CFG1 23 */
#define MXC_F_GPIO_PAD_CFG1_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_PAD_CFG1_23_POS (23)

