jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* PAD_CFG1 24 */
#define MXC_F_GPIO_PAD_CFG1_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_PAD_CFG1_24_POS (24)

/* PAD_CFG1 25 */
#define MXC_F_GPIO_PAD_CFG1_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_PAD_CFG1_25_POS (25)

/* PAD_CFG1 26 */
#define MXC_F_GPIO_PAD_CFG1_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_PAD_CFG1_26_POS (26)

/* PAD_CFG1 27 */
#define MXC_F_GPIO_PAD_CFG1_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_PAD_CFG1_27_POS (27)

/* PAD_CFG1 28 */
#define MXC_F_GPIO_PAD_CFG1_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_PAD_CFG1_28_POS (28)

/* PAD_CFG1 29 */
#define MXC_F_GPIO_PAD_CFG1_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_PAD_CFG1_29_POS (29)

/* PAD_CFG1 30 */
#define MXC_F_GPIO_PAD_CFG1_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_PAD_CFG1_30_POS (30)

/* PAD_CFG1 31 */
#define MXC_F_GPIO_PAD_CFG1_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_PAD_CFG1_31_POS (31)

/* PAD_CFG2 00 */
#define MXC_F_GPIO_PAD_CFG2_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_PAD_CFG2_00_POS (0)

/* PAD_CFG2 01 */
#define MXC_F_GPIO_PAD_CFG2_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_PAD_CFG2_01_POS (1)

/* PAD_CFG2 02 */
#define MXC_F_GPIO_PAD_CFG2_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_PAD_CFG2_02_POS (2)

/* PAD_CFG2 03 */
#define MXC_F_GPIO_PAD_CFG2_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_PAD_CFG2_03_POS (3)

/* PAD_CFG2 04 */
#define MXC_F_GPIO_PAD_CFG2_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_PAD_CFG2_04_POS (4)

/* PAD_CFG2 05 */
#define MXC_F_GPIO_PAD_CFG2_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_PAD_CFG2_05_POS (5)

/* PAD_CFG2 06 */
#define MXC_F_GPIO_PAD_CFG2_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_PAD_CFG2_06_POS (6)

/* PAD_CFG2 07 */
#define MXC_F_GPIO_PAD_CFG2_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_PAD_CFG2_07_POS (7)

/* PAD_CFG2 08 */
#define MXC_F_GPIO_PAD_CFG2_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_PAD_CFG2_08_POS (8)

/* PAD_CFG2 09 */
#define MXC_F_GPIO_PAD_CFG2_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_PAD_CFG2_09_POS (9)

/* PAD_CFG2 10 */
#define MXC_F_GPIO_PAD_CFG2_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_PAD_CFG2_10_POS (10)

/* PAD_CFG2 11 */
#define MXC_F_GPIO_PAD_CFG2_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_PAD_CFG2_11_POS (11)

/* PAD_CFG2 12 */
#define MXC_F_GPIO_PAD_CFG2_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_PAD_CFG2_12_POS (12)

/* PAD_CFG2 13 */
#define MXC_F_GPIO_PAD_CFG2_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_PAD_CFG2_13_POS (13)

/* PAD_CFG2 14 */
#define MXC_F_GPIO_PAD_CFG2_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_PAD_CFG2_14_POS (14)

/* PAD_CFG2 15 */
#define MXC_F_GPIO_PAD_CFG2_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_PAD_CFG2_15_POS (15)

/* PAD_CFG2 16 */
#define MXC_F_GPIO_PAD_CFG2_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_PAD_CFG2_16_POS (16)

/* PAD_CFG2 17 */
#define MXC_F_GPIO_PAD_CFG2_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_PAD_CFG2_17_POS (17)

/* PAD_CFG2 18 */
#define MXC_F_GPIO_PAD_CFG2_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_PAD_CFG2_18_POS (18)

/* PAD_CFG2 19 */
#define MXC_F_GPIO_PAD_CFG2_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_PAD_CFG2_19_POS (19)

/* PAD_CFG2 20 */
#define MXC_F_GPIO_PAD_CFG2_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_PAD_CFG2_20_POS (20)

/* PAD_CFG2 21 */
#define MXC_F_GPIO_PAD_CFG2_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_PAD_CFG2_21_POS (21)

/* PAD_CFG2 22 */
#define MXC_F_GPIO_PAD_CFG2_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_PAD_CFG2_22_POS (22)

/* PAD_CFG2 23 */
#define MXC_F_GPIO_PAD_CFG2_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_PAD_CFG2_23_POS (23)

/* PAD_CFG2 24 */
#define MXC_F_GPIO_PAD_CFG2_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_PAD_CFG2_24_POS (24)

/* PAD_CFG2 25 */
#define MXC_F_GPIO_PAD_CFG2_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_PAD_CFG2_25_POS (25)

/* PAD_CFG2 26 */
#define MXC_F_GPIO_PAD_CFG2_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_PAD_CFG2_26_POS (26)

/* PAD_CFG2 27 */
#define MXC_F_GPIO_PAD_CFG2_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_PAD_CFG2_27_POS (27)

/* PAD_CFG2 28 */
#define MXC_F_GPIO_PAD_CFG2_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_PAD_CFG2_28_POS (28)

/* PAD_CFG2 29 */
#define MXC_F_GPIO_PAD_CFG2_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_PAD_CFG2_29_POS (29)

/* PAD_CFG2 30 */
#define MXC_F_GPIO_PAD_CFG2_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_PAD_CFG2_30_POS (30)

/* PAD_CFG2 31 */
#define MXC_F_GPIO_PAD_CFG2_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_PAD_CFG2_31_POS (31)

/* EN1 00 */
#define MXC_F_GPIO_EN1_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_EN1_00_POS (0)

/* EN1 01 */
#define MXC_F_GPIO_EN1_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_EN1_01_POS (1)

/* EN1 02 */
#define MXC_F_GPIO_EN1_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_EN1_02_POS (2)

/* EN1 03 */
#define MXC_F_GPIO_EN1_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_EN1_03_POS (3)

/* EN1 04 */
#define MXC_F_GPIO_EN1_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_EN1_04_POS (4)

/* EN1 05 */
#define MXC_F_GPIO_EN1_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_EN1_05_POS (5)

/* EN1 06 */
#define MXC_F_GPIO_EN1_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_EN1_06_POS (6)

/* EN1 07 */
#define MXC_F_GPIO_EN1_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_EN1_07_POS (7)

/* EN1 08 */
#define MXC_F_GPIO_EN1_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_EN1_08_POS (8)

/* EN1 09 */
#define MXC_F_GPIO_EN1_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_EN1_09_POS (9)

/* EN1 10 */
#define MXC_F_GPIO_EN1_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_EN1_10_POS (10)

/* EN1 11 */
#define MXC_F_GPIO_EN1_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_EN1_11_POS (11)

/* EN1 12 */
#define MXC_F_GPIO_EN1_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_EN1_12_POS (12)

/* EN1 13 */
#define MXC_F_GPIO_EN1_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_EN1_13_POS (13)

/* EN1 14 */
#define MXC_F_GPIO_EN1_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_EN1_14_POS (14)

/* EN1 15 */
#define MXC_F_GPIO_EN1_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_EN1_15_POS (15)

