jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* EN1 16 */
#define MXC_F_GPIO_EN1_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_EN1_16_POS (16)

/* EN1 17 */
#define MXC_F_GPIO_EN1_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_EN1_17_POS (17)

/* EN1 18 */
#define MXC_F_GPIO_EN1_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_EN1_18_POS (18)

/* EN1 19 */
#define MXC_F_GPIO_EN1_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_EN1_19_POS (19)

/* EN1 20 */
#define MXC_F_GPIO_EN1_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_EN1_20_POS (20)

/* EN1 21 */
#define MXC_F_GPIO_EN1_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_EN1_21_POS (21)

/* EN1 22 */
#define MXC_F_GPIO_EN1_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_EN1_22_POS (22)

/* EN1 23 */
#define MXC_F_GPIO_EN1_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_EN1_23_POS (23)

/* EN1 24 */
#define MXC_F_GPIO_EN1_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_EN1_24_POS (24)

/* EN1 25 */
#define MXC_F_GPIO_EN1_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_EN1_25_POS (25)

/* EN1 26 */
#define MXC_F_GPIO_EN1_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_EN1_26_POS (26)

/* EN1 27 */
#define MXC_F_GPIO_EN1_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_EN1_27_POS (27)

/* EN1 28 */
#define MXC_F_GPIO_EN1_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_EN1_28_POS (28)

/* EN1 29 */
#define MXC_F_GPIO_EN1_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_EN1_29_POS (29)

/* EN1 30 */
#define MXC_F_GPIO_EN1_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_EN1_30_POS (30)

/* EN1 31 */
#define MXC_F_GPIO_EN1_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_EN1_31_POS (31)

/* RSV 00 */
#define MXC_F_GPIO_RSV_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_RSV_00_POS (0)

/* RSV 01 */
#define MXC_F_GPIO_RSV_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_RSV_01_POS (1)

/* RSV 02 */
#define MXC_F_GPIO_RSV_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_RSV_02_POS (2)

/* RSV 03 */
#define MXC_F_GPIO_RSV_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_RSV_03_POS (3)

/* RSV 04 */
#define MXC_F_GPIO_RSV_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_RSV_04_POS (4)

/* RSV 05 */
#define MXC_F_GPIO_RSV_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_RSV_05_POS (5)

/* RSV 06 */
#define MXC_F_GPIO_RSV_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_RSV_06_POS (6)

/* RSV 07 */
#define MXC_F_GPIO_RSV_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_RSV_07_POS (7)

/* RSV 08 */
#define MXC_F_GPIO_RSV_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_RSV_08_POS (8)

/* RSV 09 */
#define MXC_F_GPIO_RSV_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_RSV_09_POS (9)

/* RSV 10 */
#define MXC_F_GPIO_RSV_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_RSV_10_POS (10)

/* RSV 11 */
#define MXC_F_GPIO_RSV_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_RSV_11_POS (11)

/* RSV 12 */
#define MXC_F_GPIO_RSV_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_RSV_12_POS (12)

/* RSV 13 */
#define MXC_F_GPIO_RSV_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_RSV_13_POS (13)

/* RSV 14 */
#define MXC_F_GPIO_RSV_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_RSV_14_POS (14)

/* RSV 15 */
#define MXC_F_GPIO_RSV_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_RSV_15_POS (15)

/* RSV 16 */
#define MXC_F_GPIO_RSV_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_RSV_16_POS (16)

/* RSV 17 */
#define MXC_F_GPIO_RSV_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_RSV_17_POS (17)

/* RSV 18 */
#define MXC_F_GPIO_RSV_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_RSV_18_POS (18)

/* RSV 19 */
#define MXC_F_GPIO_RSV_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_RSV_19_POS (19)

/* RSV 20 */
#define MXC_F_GPIO_RSV_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_RSV_20_POS (20)

/* RSV 21 */
#define MXC_F_GPIO_RSV_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_RSV_21_POS (21)

/* RSV 22 */
#define MXC_F_GPIO_RSV_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_RSV_22_POS (22)

/* RSV 23 */
#define MXC_F_GPIO_RSV_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_RSV_23_POS (23)

/* RSV 24 */
#define MXC_F_GPIO_RSV_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_RSV_24_POS (24)

/* RSV 25 */
#define MXC_F_GPIO_RSV_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_RSV_25_POS (25)

/* RSV 26 */
#define MXC_F_GPIO_RSV_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_RSV_26_POS (26)

/* RSV 27 */
#define MXC_F_GPIO_RSV_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_RSV_27_POS (27)

/* RSV 28 */
#define MXC_F_GPIO_RSV_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_RSV_28_POS (28)

/* RSV 29 */
#define MXC_F_GPIO_RSV_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_RSV_29_POS (29)

/* RSV 30 */
#define MXC_F_GPIO_RSV_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_RSV_30_POS (30)

/* RSV 31 */
#define MXC_F_GPIO_RSV_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_RSV_31_POS (31)

/* DS 00 */
#define MXC_F_GPIO_DS_00 ((uint32_t)0x00000001UL)
#define MXC_F_GPIO_DS_00_POS (0)

/* DS 01 */
#define MXC_F_GPIO_DS_01 ((uint32_t)0x00000002UL)
#define MXC_F_GPIO_DS_01_POS (1)

/* DS 02 */
#define MXC_F_GPIO_DS_02 ((uint32_t)0x00000004UL)
#define MXC_F_GPIO_DS_02_POS (2)

/* DS 03 */
#define MXC_F_GPIO_DS_03 ((uint32_t)0x00000008UL)
#define MXC_F_GPIO_DS_03_POS (3)

/* DS 04 */
#define MXC_F_GPIO_DS_04 ((uint32_t)0x00000010UL)
#define MXC_F_GPIO_DS_04_POS (4)

/* DS 05 */
#define MXC_F_GPIO_DS_05 ((uint32_t)0x00000020UL)
#define MXC_F_GPIO_DS_05_POS (5)

/* DS 06 */
#define MXC_F_GPIO_DS_06 ((uint32_t)0x00000040UL)
#define MXC_F_GPIO_DS_06_POS (6)

/* DS 07 */
#define MXC_F_GPIO_DS_07 ((uint32_t)0x00000080UL)
#define MXC_F_GPIO_DS_07_POS (7)

/* DS 08 */
#define MXC_F_GPIO_DS_08 ((uint32_t)0x00000100UL)
#define MXC_F_GPIO_DS_08_POS (8)

/* DS 09 */
#define MXC_F_GPIO_DS_09 ((uint32_t)0x00000200UL)
#define MXC_F_GPIO_DS_09_POS (9)

/* DS 10 */
#define MXC_F_GPIO_DS_10 ((uint32_t)0x00000400UL)
#define MXC_F_GPIO_DS_10_POS (10)

/* DS 11 */
#define MXC_F_GPIO_DS_11 ((uint32_t)0x00000800UL)
#define MXC_F_GPIO_DS_11_POS (11)

/* DS 12 */
#define MXC_F_GPIO_DS_12 ((uint32_t)0x00001000UL)
#define MXC_F_GPIO_DS_12_POS (12)

