jeremybrodt/CMSIS-DAP/shared/cmsis/TARGET_Maxim/TARGET_MAX32550/Include/gpio_regs.h
/* DS 13 */
#define MXC_F_GPIO_DS_13 ((uint32_t)0x00002000UL)
#define MXC_F_GPIO_DS_13_POS (13)

/* DS 14 */
#define MXC_F_GPIO_DS_14 ((uint32_t)0x00004000UL)
#define MXC_F_GPIO_DS_14_POS (14)

/* DS 15 */
#define MXC_F_GPIO_DS_15 ((uint32_t)0x00008000UL)
#define MXC_F_GPIO_DS_15_POS (15)

/* DS 16 */
#define MXC_F_GPIO_DS_16 ((uint32_t)0x00010000UL)
#define MXC_F_GPIO_DS_16_POS (16)

/* DS 17 */
#define MXC_F_GPIO_DS_17 ((uint32_t)0x00020000UL)
#define MXC_F_GPIO_DS_17_POS (17)

/* DS 18 */
#define MXC_F_GPIO_DS_18 ((uint32_t)0x00040000UL)
#define MXC_F_GPIO_DS_18_POS (18)

/* DS 19 */
#define MXC_F_GPIO_DS_19 ((uint32_t)0x00080000UL)
#define MXC_F_GPIO_DS_19_POS (19)

/* DS 20 */
#define MXC_F_GPIO_DS_20 ((uint32_t)0x00100000UL)
#define MXC_F_GPIO_DS_20_POS (20)

/* DS 21 */
#define MXC_F_GPIO_DS_21 ((uint32_t)0x00200000UL)
#define MXC_F_GPIO_DS_21_POS (21)

/* DS 22 */
#define MXC_F_GPIO_DS_22 ((uint32_t)0x00400000UL)
#define MXC_F_GPIO_DS_22_POS (22)

/* DS 23 */
#define MXC_F_GPIO_DS_23 ((uint32_t)0x00800000UL)
#define MXC_F_GPIO_DS_23_POS (23)

/* DS 24 */
#define MXC_F_GPIO_DS_24 ((uint32_t)0x01000000UL)
#define MXC_F_GPIO_DS_24_POS (24)

/* DS 25 */
#define MXC_F_GPIO_DS_25 ((uint32_t)0x02000000UL)
#define MXC_F_GPIO_DS_25_POS (25)

/* DS 26 */
#define MXC_F_GPIO_DS_26 ((uint32_t)0x04000000UL)
#define MXC_F_GPIO_DS_26_POS (26)

/* DS 27 */
#define MXC_F_GPIO_DS_27 ((uint32_t)0x08000000UL)
#define MXC_F_GPIO_DS_27_POS (27)

/* DS 28 */
#define MXC_F_GPIO_DS_28 ((uint32_t)0x10000000UL)
#define MXC_F_GPIO_DS_28_POS (28)

/* DS 29 */
#define MXC_F_GPIO_DS_29 ((uint32_t)0x20000000UL)
#define MXC_F_GPIO_DS_29_POS (29)

/* DS 30 */
#define MXC_F_GPIO_DS_30 ((uint32_t)0x40000000UL)
#define MXC_F_GPIO_DS_30_POS (30)

/* DS 31 */
#define MXC_F_GPIO_DS_31 ((uint32_t)0x80000000UL)
#define MXC_F_GPIO_DS_31_POS (31)

#ifdef __cplusplus
}
#endif

#endif /* _MXC_GPIO_REGS_H_ */
